{
    "categories": [
        {
            "name": "Full Stack",
            "visible": true,
            "projects": [
                {
                    "name": "GoodHood (Current Volunteer Project)",
                    "url": "https://www.goodhood.io/",
                    "description": "Data visualization tool to help potential home buyers make informed decisions about where to move. This is an unpaid, volunteer project that I am working with the project lead on, including code reviews on GitHub. My improvenements included implementing features in React, such as Authentication dialogues, as well as bug-fixes. Additionally, I have implemented data pipelines to process test score data for public schools in Virginia as part of school quality metrics using Python with Pandas, which we intend on generalizing as best possible to the whole country. Currently, I am working on writing test cases for the website using React's TestingLibrary, as well as partially desigining the database backend to store and process the testing metrics."
                }
            ]
        },
        {
            "name": "Front-End",
            "visible": true,
            "projects": [
                {
                    "name": "Memory Card Game",
                    "sourceCode": "https://github.com/meepcode/memory-card-game",
                    "url": "https://meepcode.github.io/memory-card-game",
                    "description": "Simple card game written using React and Typescript. Deals a hand of cards for the user to click, and the user must click a different card each hand to win. Clicking the same card twice in one game is a loss. Card images and details fetched using async/await from PokeAPI."
                },
                {
                    "name": "Wardrobe Whiz",
                    "sourceCode": "https://github.com/meepcode/wardrobe-whiz",
                    "description": "Mock website capable of CRUD (Create, Read, Update, Delete) and asyncronous API calls to shopping websites for creating outfits. Written in HTML, CSS, and JS with Bootstrap and passes accessibility checks."
                },
                {
                    "name": "Personal Website",
                    "sourceCode": "https://github.com/meepcode/meepcode.github.io",
                    "description": "My personal website (the one that you are on currently!) hosted using GitHub Pages. Written by hand using React."
                }
            ]
        },
        {
            "name": "Back-End",
            "visible": true,
            "projects": [
                {
                    "name": "Hotel Database",
                    "sourceCode": "https://github.com/meepcode/Hotel-Database",
                    "description": "Mock SQL-based database written with a front-end in Python. Created to be able to manage the database for a fictional hotel chain including managing rooms, reservations, employees, billing, and services."
                }
            ]
        },
        {
            "name": "Machine Learning",
            "visible": true,
            "projects": [
                {
                    "name": "LLM Embedding",
                    "sourceCode": "https://github.com/meepcode/LLM-Embedding",
                    "description": "Machine learning model for embeddings written in Python using Keras and Tensorflow and trained on the HuggingFace Wikipedia dataset. It was trained using the same method as GLoVe."
                }
            ]
        },
        {
            "name": "Application",
            "visible": true,
            "projects": [
                {
                    "name": "Spreadterm",
                    "sourceCode": "https://github.com/meepcode/spreadterm",
                    "description": "TUI-based spreadsheet application written in Rust and ncurses."
                },
                {
                    "name": "Rimplex",
                    "sourceCode": "https://github.com/meepcode/rimplex",
                    "description": "Java Swing-based calculator capable of processing and handling complex numbers. Written in three mock Agile/Scrum sprints."
                }
            ]
        },
        {
            "name": "Systems",
            "visible": false
        }
    ]
}